{
    "full_text": " Let's now welcome the candidates to the stage. Vice President Kamala Harris and President Donald Trump. Yes. Kamala Harris, is that good to be? You should see. Have fun. Thank you. Welcome to you both. It's wonderful to have you. It's an honor to have you both here tonight. Vice President Harris, in your last run for President, you said you wanted to ban fracking. Now you don't. You wanted mandatory government buyback programs for assault weapons. Now your campaign says you don't. You supported decriminalizing border crossings. Now you're taking a harder line. I know you say that your values have not changed. So then why have so many of your policy positions changed? So my values have not changed. And I'm going to discuss every one of the, at least every point that you've made. But in particular, let's talk about fracking because we're here in Pennsylvania. I made that very clear in 2020. I will not ban fracking. I have not banned fracking as Vice President of the United States. And in fact, I was the tie breaking vote on the Inflation Reduction Act, which opened new leases for fracking. My position is that we have got to invest in diverse sources of energy. So we reduce our reliance on foreign oil. We have had the largest increase in domestic oil production in history because of an approach that recognizes that we cannot over rely on foreign oil. As it relates to my values, let me tell you, I grew up a middle-class kid raised by a hardworking mother who worked and saved and was able to buy our first home when I was a teenager. The values I bring to the importance of home ownership knowing not everybody got handed. $400 million on a silver platter and then filed bankruptcy six times. Is a value that I bring to my work to say we are going to work with the private sector and home builders to increase 3 million homes, increased by 3 million homes by the end of my first term. My work that is related to having a friend when I was in high school who was actually assaulted by her stepfather. And my focus then on protecting women and children from violent crime is based on a value that is deeply grounded in the importance of standing up for those who are most vulnerable. My work that is about protecting social security and Medicare is based on long-standing work that I have done. Protecting seniors from scams. My values have not changed. And what is important is that there is a president who actually brings values and a perspective that is about lifting people up and not beating people down and name calling. The true measure of the leader is the leader who actually understands the strength is not in beating people down. It is in lifting people up. I intend to be that president. President Trump, your response. Well first of all I wasn't given $400 million. I wish I was. My father was a Brooklyn builder, Brooklyn Queens and a great father and I learned a lot from him. But I was given a fraction of that, a tiny fraction and I have built it into many, many billions of dollars, many, many billions. And when people see it they are even surprised. So we don't have to talk about that. Fracking, she's been against it for 12 years. Defund the police, she's been against that forever. She gave all that stuff up very wrongly, very horribly, and everybody's laughing at it. Okay, they're all laughing at it. She gave up at least 12 and probably 14 or 15 different policies. Like she was big on defund the police. In Minnesota she went out, what am I, I'm talking now. You know mine please. Does that sound familiar? She went out. She went out in Minnesota and wanted to let criminals that killed people that burned down Minneapolis. She went out and raised money to get them out of jail. She did things that nobody would ever think of. Now she wants to do transgender operations or illegal aliens that are in prison. This is a radical left liberal that would do this. She wants to confiscate your guns and she will never allow fracking in Pennsylvania. If she won the election, fracking in Pennsylvania will end on day one. Just to finish one thing, it's so important in my opinion. So I got the oil business going like nobody has ever done before. They took, when they took over, they got rid of it, started getting rid of it, and the prices were going up the roof. They immediately let these guys go to where they were. I would have been five times, four times, five times higher because you're talking about three and a half years ago. They got it up to where I was because they had no choice because the prices of energy were quite droopling and doubling. You saw what happened to gasoline. So they said, let's go back to Trump. But if she won the election, the day after that election, they'll go back to destroying our country. And oil will be dead, fossil fuel will be dead. We'll go back to windmills and we'll go back to solar where they need a whole desert to get some energy to come out of. You ever see a solar plant? By the way, I'm a big fan of solar. But they take four hundred, five hundred acres of desert soil. These are not good things that we have to get to. We have an election in just 56 days. And I want to talk about the peaceful transfer of power, which of course we all know is a cornerstone of our democracy and the role of a president in a moment of crisis. Mr. President, on January 6th, you told your supporters to march to the Capitol. You said you would be right there with them. The country in the world saw what played out of the Capitol that day. The officers coming under attack. Aids in the West Wing say you watched it unfold on television off the Oval Office. You did send out tweets, but it was more than two hours before you sent out that video message telling your supporters to go home. Is there anything you regret about what you did on that day? You just said a thing that is uncovered peacefully and patriatically. I said during my speech, not later on, peacefully and patriatically. And nobody on the other side was killed. Ashley Babitt was shot by an out of control police officer that should have never, ever shot her. It's a disgrace. But we didn't do this group of people that have been treated so badly. I asked, what about all the people that are pouring into our country and killing people that she allowed to put in? She was the voters are. Remember that. She was the voters are. She doesn't want to be called the voters are because she's embarrassed by the voter. In fact, she said at the beginning, well, I'm surprised you're not talking about the voter yet. That's because she knows what a bad job they've done. What about those people? What are they going to be prosecuted? One of these people from countries all over the world, not just South America. They're coming in from all over the world, David, all over the world, and crime rates are down all over the world because of it. But let me just answer that. One of those people going to be prosecuted. One of the people that burned down Minneapolis going to be prosecuted or in Seattle. They went into Seattle. They took over a big percentage of the city of Seattle. One of those people going to be prosecuted. But let me just ask you might ask you that question. You were the president. You were watching an unfold on television. It's a very simple question as we move forward toward another election. Is there anything you regret about what you did on that day? I had nothing to do with that other than they asked me to make a speech. I showed up for a speech. I think it's going to be big. I went to Nancy Pelosi and the mayor of Washington, D.C. And the mayor put it back in writing, as you know. I said, you know, this is going to be a very big rally or whatever you want to call it. And again, it wasn't done by me. It was done by others. I said, I'd like to give you 10,000 National Guard or soldiers. They rejected me. Nancy Pelosi rejected me. It was just two weeks ago her daughter has a tape of her saying she is fully responsible for what happened. They want to get rid of that tape. It would have never happened if Nancy Pelosi and the mayor of Washington did their jobs. I wasn't responsible for security. Nancy Pelosi was responsible. She didn't do her job. The question was about you as president, not about former speaker Pelosi. But I do want Vice President Harris to respond here. I was at the Capitol on January 6th. I was the Vice President-Elect. I was also an acting senator. I was there. And on that day, the President of the United States incited a violent mob to attack our nation's Capitol, to desecrate our nation's Capitol on that day, 140 law enforcement officers were injured, and some died. And understand, the former president has been indicted and impeached for exactly that reason. But this is not an isolated situation. Let's remember Charlottesville, where there was a mob of people carrying teaky torches, spewing anti-Semitic hate. And what did the president then, at the time, say, there were fine people on each side? Let's remember that when it came to the proud boys, a militia. The president said, the former president said, stand back and stand by. So for everyone watching who remembers what January 6th was, I say, we don't have to go back. Let's not go back. We're not going back. It's time to turn the page. And if that was a bridge too far for you, well, there is a place in our campaign for you, to stand for country, to stand for our democracy, to stand for rule of law, and to end the chaos, and to end the approach that is about attacking the foundations of our democracy, because you don't like the outcome and be clear on that point. Donald Trump, the candidate, has said in this election, there will be a blood bath. If this and the outcome of this election is not to his liking, let's turn the page on this. Let's not go back. Let's chart a course for the future and not go backwards to the past. Let me just follow up here. It was a different term, and it was a term that related to energy, because they have destroyed our energy business. That was where blood bath was. Also, one Charlottesville, that story has been, as you would say, debunked, Laura Ingram. Sean Hannity, Jesse, all of these people, they covered it. If they go an extra sentence, they will see it was perfect. It was debunked in almost every newspaper, but they still bring it up, just like they bring 2025 up. They bring all of this stuff up. I ask you this. You talk about the Capitol. Why are we allowing these millions of people to come through on the Southern border? How come she's not doing anything? And I'll tell you what I would do, and I would be very proud to do it. I would say we would both leave this debate right now. I'd like to see her go down to Washington, D.C. during this debate, because we're wasting a lot of time. Go down to, because she's been so bad. It's so ridiculous. Go down to Washington, D.C. and let her sign a bill to close up the border, because they have the right to do it. They don't need bills. They have the right to do it. The president of the United States, you'll get him out of bed. You'll wake him up at four o'clock in the afternoon. You'll say, come on. Come on down to the office. Let's sign a bill. If he signs a bill that the border is closed, only has to do a say it to the border patrol who are phenomenal. If they do that, the border is closed. Those people are killing many people, unlike J6. I want to turn to Afghanistan. It came up in the first hour of the debate, and we witnessed a poignant moment today on Capitol Hill honoring the soldiers who died in the chaotic withdrawal from Afghanistan. Do you want to ask the vice president? Do you believe you bear any responsibility in the way that withdrawal played out? Well, I will tell you, I agreed with President Biden's decision to pull out of Afghanistan. Four presidents said they would, and Joe Biden did. And as a result, America's taxpayers are not paying the $300 million a day. We were paying for that endless war. And as of today, there is not one member of the United States military who is an active duty in a combat zone, in any war zone around the world, the first time this century. But let's understand how we got to where we are. Donald Trump, when he was president, negotiated one of the weakest deals you can imagine. He calls himself a deal maker, even his national security adviser said it was a weak, terrible deal. And here's how it went down. He bypassed the Afghan government. He negotiated directly with a terrorist organization called the Taliban. The negotiation involved the Taliban getting 5,000 terrorists, Taliban terrorists released. And get this, no get this. And the president at the time invited the Taliban to cap David a place of storied significance for us as Americans, a place where we honor the importance of American diplomacy where we invite and receive. Respected world leaders. And this former president, as president, invited them to cap David because he does not again appreciate the role and responsibility of the president of the United States to be commander in chief with a level of respect. And this gets back to the point of how he has consistently disperged and demeaned members of our military, fallen soldiers, and the work that we must do to uphold the strength and the respect of the United States of America around the world. Vice President Harris, thank you. President Trump, your response to her saying that you began the negotiations with the Taliban. Thank you. So if you take a look at that period of time, the Taliban was killing our soldiers, a lot of them with snipers. And I got involved with the Taliban because the Taliban was doing the killing. That's the fighting force within Afghanistan. They don't bother doing that because you know, they deal with the wrong people all the time. But I got involved and Abdul is the head of the Taliban. He is still the head of the Taliban. And I told Abdul don't do it anymore. You do it anymore. You're going to have problems. And he said, why do you send me a picture of my house? I said, you're going to have to figure that out, Abdul. And for 18 months, we had nobody killed. We did have an agreement negotiated by Mike Pompeo. It was a very good agreement. The reason it was good. It was, we were getting out. We would have been out faster than them. But we wouldn't have lost the soldiers. We wouldn't have left many Americans behind. And we wouldn't have left. We wouldn't have left 85 billion dollars worth of brand new beautiful military equipment behind. And just to finish, they blew it. The agreement said you have to do this, this, this, this, this. And they didn't do it. They didn't do it. The agreement was, was terminated by us because they didn't do what they were supposed to do. I want to move on. And these people did the worst withdrawal. And in my opinion, the most embarrassing moment in the history of our country. And by the way, that's why Russia attacked Ukraine because they saw how incompetent she and her boss are. And this was a staggeringly dishonest debate performance from former President Trump. Just lie after lie on subject, after subject. By my preliminary count, Jake Trump made at least 33 false claims, 33. By contrast, by again, a preliminary count, Vice President Harris made at least one false claim, though she added at least a few misleading claims and a few more that lack key context. And I can say, well, all politicians lie, no major presidential candidate before Donald Trump has ever lied with this kind of frequency. A remarkably large chunk of what he said tonight was just not true. And this wasn't like little exaggeration political spin. A lot of his false claims were untethered to reality. On abortion, saying every Democrat wanted Roe v. Wade overturned, though actually more than 80% of Democrats supported Roe on crime saying it's through the roof, though it's actually sharply down since early 2023. It's now lower than it was since Trump left office on health care saying he's the one who saved Obamacare, the law he actually repeatedly tried to overturn on Kamala Harris herself saying that a Howard University grad black law students association president had claimed that she wasn't black. At one point, frankly, I don't have enough time here to run through each specific Trump false claim. I urge people to go to our CNN website or our app to read our team's detailed facts checks on this and a whole bunch more. For now, though, let's dive into one false claim Trump made an agreedist claim about migrants supposedly eating people's pets. In Springfield, they're eating the dogs, the people that came in, they're eating the cats, they're eating the pets of the people that live there. This is not only false, I think it's fair to call this odious. This for people who have not been online in the last couple of days, this claim about migrants, Haitian migrants in Springfield, Ohio eating people's pets originated with a Facebook post that attributed the claim to a neighbor's friend's daughter. So, a third hand broken telephone kind of thing, the city of Springfield and the Springfield police said there are no credible reports of this happening. And even JD Vance, the vice presidential candidate who himself had promoted these claims, acknowledged this morning that the quote rumors might turn out false, although he still encouraged people to spread these cat memes. Now I'll note that Trump himself added dogs to the equation. They had not even been part of these viral nonsense rumors before. Now let's look at a one false claim that Vice President Harris did make about the economic situation that the Biden-Harris Administration was left by Trump. Let's talk about what Donald Trump left us. Donald Trump left us the worst unemployment since the Great Depression. And what we have done is clean up Donald Trump's mess. So the Biden-Harris Administration was not actually left the worst unemployment since the Great Depression. They were left at 6.4% unemployment rate in January 2021. That was certainly elevated by recent standards pretty high, but it was significantly downed from the 14.8% level. It reached early in the pandemic, so it was already improving at the time the Biden-Harris Administration took office. And that 6.4% level was the highest since the Great Recession, so in the last 20 years, not going back decades further. The first results of our instant poll of debate watchers have just come in. David Chalian is going to join us now to break it all down. David, tell us more. Yeah, Jake, and as you noted, this is a poll of debate watchers. This is not a poll that represents the overall population, although in partisan breakdown, it is pretty close to what the overall registered voter population looks like in the country. But it is a poll of those people that watched the debate. So just keep that in mind as we get to these results. Our first result here in our exclusive flash poll, who won the debate? The overall number here overwhelmingly Kamala Harris did. I'm going to look at my email here. 63% you see there on your screen. Say Kamala Harris won the debate. Only 37% say Donald Trump won the debate. And that is quite different than the expectations going into this among this group of debate watchers in this poll. We asked folks going into the debate, who do you expect to win the debate? Well, it was 50, 50% expected Harris, 50% expected Trump to win the debate. That was before the debate. And we just showed you where it ended up afterwards. 63% to 37%. And take a look at this, Jake. This is a complete reversal from what we saw in June. Compare these numbers to Biden in June. You see that it was 67% to 33%. Two thirds, taking Trump won only a third thinking Biden won a complete reversal in just a few months as this race has completely changed. So too has the assessment of debate watchers about the Democrat and Republican debate performances this 2024 presidential election, Jake. All right, David Chellion. And while no doubt this debate will not be quite as consequential as the last one, it does seem as though a database that the, at least according to the instant polls of debate watchers, people think the Kamala Harris resoundingly won. And to fight expectations based on what people thought beforehand and afterwards. As David was saying, we have to be careful with instant polls. And what is really going to matter is how this sinks in and ripples through the pool, very small but important pool of undecided voters. But I think the only thing that you need to know about how Donald Trump realizes that this went was to see his behavior and performance, the fact that he came into this bedroom and he was not very happy. Insighting a bunch of numbers of polls that he said he won, no clue where those numbers came from. And he was asked about it in the spin room and didn't give an answer. But I also think, you know, Harris, there were some risks here for her tonight. And she had a lot of work to do. And I'm thinking about earlier when we were talking. And I was struck recently in the last couple of weeks, just watching Trump in his normal campaign world on the stump in interviews. And he is progressively slowing down. He is progressively not able to really even make his own normal kind of cases that he would make about all sorts of issues. And that was on display tonight. I mean, she was really helped by Trump, just not really being able to kind of take it to her on virtually anything. And in a way, her biggest weakness might have been that when you give her something that she's not prepared for, she may or may not be able to address it. But Trump never did that. He only gave her things that it would be very obvious that he would say on the debate stage. And I think that's one of the main reasons that she was able to just kind of quite impressively actually take a lot of preparation and just spit it right out on that debate stage almost exactly probably the way her advisors wanted her to. And Trump just wasn't nimble enough to even respond to that. And he dove into his little pit of grievance and he's aging and it shows it's showing on the debates, it's showing on the campaign. One of the things that presidential debates have done over the years is that at times when people have had doubts about a candidate, usually the challenger in this race, you could argue they're both incumbents or both challengers. And it has erased the stature gap in 1960. Nixon was the vice president, the criticism of John Kennedy was that he was too young to calo to an experienced after that first debate that went away because people thought at the very least that Kennedy showed that he stood up and was the Nixon's equal and perhaps his superior 1980 Jimmy Carter, a lot of concern. It was Ronald Reagan too big a risk and after that debate people were reassured they didn't they didn't like Carter particularly and they were reassured we can take this jump into Reagan in the New York Times poll over the weekend three times as many people said they needed to know more about Kamala Harris than said that about Donald Trump. And I got to think for a lot of that 28% of Americans that they were reassured by what they saw tonight so I think that it it gives permission to support her for people that had doubts. Well, there's two things I noticed one was the word that Senator JD Vance used the word platitudes when he talked to Caitlin Collins about how he describes the ability of vice president Harris to articulate her platforms. It's what is demanded of the incumbent versus what was actually provided by a former incumbent she's expected to talk in very granular detail Trump had very many balled assertions and yet he believes that he was successful in that endeavor nonetheless. The other issue is this important idea of managing expectations. She has described herself from the very get-go since she's actually taking the top and taking it as the underdog. In part because Democrats do not want a performance like this to have people believing there's no reason to lean in they can lean out everything's in the bag they know there is still the uphill battle of trying to overcome a number of factors. So I think in many ways these are certain polar polls show you that even though this was a successful endeavor I think arguably and objectively for the vice president she still has to overcome this. I can't tell what the language encoding it is to have her define herself still.",
    "overall_summary": "fracking is a key issue for the country's economy, says alan scott. scott: fracking is a key issue for the country's economy. he says fracking is a key issue for the country's economy. scott: fracking is a key issue for the country's economy.",
    "segments": [
        {
            "text": "Let's now welcome the candidates to the stage. Vice President Kamala Harris and President Donald Trump. Yes. Kamala Harris, is that good to be? You should see. Have fun. Thank you. Welcome to you both. It's wonderful to have you. It's an honor to have you both here tonight. Vice President Harris, in your last run for President, you said you wanted to ban fracking. Now you don't. You wanted mandatory government buyback programs for assault weapons. Now your campaign says you don't. You supported decriminalizing border crossings. Now you're taking a harder line. I know you say that your values have not changed. So then why have so many of your policy positions changed? So my values have not changed. And I'm going to discuss every one of the, at least every point that you've made. But in particular, let's talk about fracking because we're here in Pennsylvania. I made that very clear in 2020. I will not ban fracking. I have not banned fracking as Vice President of the United States. And in fact, I was the tie breaking vote on the Inflation Reduction Act, which opened new leases for fracking. My position is that we have got to invest in diverse sources of energy. So we reduce our reliance on foreign oil. We have had the largest increase in domestic oil production in history because of an approach that recognizes that we cannot over rely on foreign oil. As it relates to my values, let me tell you, I grew up a middle-class kid raised by a",
            "start": "00:00:00",
            "end": "00:02:00"
        },
        {
            "text": "hardworking mother who worked and saved and was able to buy our first home when I was a teenager. The values I bring to the importance of home ownership knowing not everybody got handed. $400 million on a silver platter and then filed bankruptcy six times. Is a value that I bring to my work to say we are going to work with the private sector and home builders to increase 3 million homes, increased by 3 million homes by the end of my first term. My work that is related to having a friend when I was in high school who was actually assaulted by her stepfather. And my focus then on protecting women and children from violent crime is based on a value that is deeply grounded in the importance of standing up for those who are most vulnerable. My work that is about protecting social security and Medicare is based on long-standing work that I have done. Protecting seniors from scams. My values have not changed. And what is important is that there is a president who actually brings values and a perspective that is about lifting people up and not beating people down and name calling. The true measure of the leader is the leader who actually understands the strength is not in beating people down. It is in lifting people up. I intend to be that president. President Trump, your response. Well first of all I wasn't given $400 million. I wish I was. My father was a Brooklyn builder, Brooklyn Queens and a great",
            "start": "00:02:00",
            "end": "00:04:00"
        },
        {
            "text": "father and I learned a lot from him. But I was given a fraction of that, a tiny fraction and I have built it into many, many billions of dollars, many, many billions. And when people see it they are even surprised. So we don't have to talk about that. Fracking, she's been against it for 12 years. Defund the police, she's been against that forever. She gave all that stuff up very wrongly, very horribly, and everybody's laughing at it. Okay, they're all laughing at it. She gave up at least 12 and probably 14 or 15 different policies. Like she was big on defund the police. In Minnesota she went out, what am I, I'm talking now. You know mine please. Does that sound familiar? She went out. She went out in Minnesota and wanted to let criminals that killed people that burned down Minneapolis. She went out and raised money to get them out of jail. She did things that nobody would ever think of. Now she wants to do transgender operations or illegal aliens that are in prison. This is a radical left liberal that would do this. She wants to confiscate your guns and she will never allow fracking in Pennsylvania. If she won the election, fracking in Pennsylvania will end on day one. Just to finish one thing, it's so important in my opinion. So I got the oil business going like nobody has ever done before. They took, when they took over, they got rid of it, started getting rid of it, and",
            "start": "00:04:00",
            "end": "00:06:00"
        },
        {
            "text": "the prices were going up the roof. They immediately let these guys go to where they were. I would have been five times, four times, five times higher because you're talking about three and a half years ago. They got it up to where I was because they had no choice because the prices of energy were quite droopling and doubling. You saw what happened to gasoline. So they said, let's go back to Trump. But if she won the election, the day after that election, they'll go back to destroying our country. And oil will be dead, fossil fuel will be dead. We'll go back to windmills and we'll go back to solar where they need a whole desert to get some energy to come out of. You ever see a solar plant? By the way, I'm a big fan of solar. But they take four hundred, five hundred acres of desert soil. These are not good things that we have to get to. We have an election in just 56 days. And I want to talk about the peaceful transfer of power, which of course we all know is a cornerstone of our democracy and the role of a president in a moment of crisis. Mr. President, on January 6th, you told your supporters to march to the Capitol. You said you would be right there with them. The country in the world saw what played out of the Capitol that day. The officers coming under attack. Aids in the West Wing say you watched it unfold on",
            "start": "00:06:00",
            "end": "00:08:00"
        },
        {
            "text": "television off the Oval Office. You did send out tweets, but it was more than two hours before you sent out that video message telling your supporters to go home. Is there anything you regret about what you did on that day? You just said a thing that is uncovered peacefully and patriatically. I said during my speech, not later on, peacefully and patriatically. And nobody on the other side was killed. Ashley Babitt was shot by an out of control police officer that should have never, ever shot her. It's a disgrace. But we didn't do this group of people that have been treated so badly. I asked, what about all the people that are pouring into our country and killing people that she allowed to put in? She was the voters are. Remember that. She was the voters are. She doesn't want to be called the voters are because she's embarrassed by the voter. In fact, she said at the beginning, well, I'm surprised you're not talking about the voter yet. That's because she knows what a bad job they've done. What about those people? What are they going to be prosecuted? One of these people from countries all over the world, not just South America. They're coming in from all over the world, David, all over the world, and crime rates are down all over the world because of it. But let me just answer that. One of those people going to be prosecuted. One of the people that burned down Minneapolis going to be prosecuted or",
            "start": "00:08:00",
            "end": "00:10:00"
        },
        {
            "text": "in Seattle. They went into Seattle. They took over a big percentage of the city of Seattle. One of those people going to be prosecuted. But let me just ask you might ask you that question. You were the president. You were watching an unfold on television. It's a very simple question as we move forward toward another election. Is there anything you regret about what you did on that day? I had nothing to do with that other than they asked me to make a speech. I showed up for a speech. I think it's going to be big. I went to Nancy Pelosi and the mayor of Washington, D.C. And the mayor put it back in writing, as you know. I said, you know, this is going to be a very big rally or whatever you want to call it. And again, it wasn't done by me. It was done by others. I said, I'd like to give you 10,000 National Guard or soldiers. They rejected me. Nancy Pelosi rejected me. It was just two weeks ago her daughter has a tape of her saying she is fully responsible for what happened. They want to get rid of that tape. It would have never happened if Nancy Pelosi and the mayor of Washington did their jobs. I wasn't responsible for security. Nancy Pelosi was responsible. She didn't do her job. The question was about you as president, not about former speaker Pelosi. But I do want Vice President Harris to respond here. I was at the Capitol on",
            "start": "00:10:00",
            "end": "00:12:00"
        },
        {
            "text": "January 6th. I was the Vice President-Elect. I was also an acting senator. I was there. And on that day, the President of the United States incited a violent mob to attack our nation's Capitol, to desecrate our nation's Capitol on that day, 140 law enforcement officers were injured, and some died. And understand, the former president has been indicted and impeached for exactly that reason. But this is not an isolated situation. Let's remember Charlottesville, where there was a mob of people carrying teaky torches, spewing anti-Semitic hate. And what did the president then, at the time, say, there were fine people on each side? Let's remember that when it came to the proud boys, a militia. The president said, the former president said, stand back and stand by. So for everyone watching who remembers what January 6th was, I say, we don't have to go back. Let's not go back. We're not going back. It's time to turn the page. And if that was a bridge too far for you, well, there is a place in our campaign for you, to stand for country, to stand for our democracy, to stand for rule of law, and to end the chaos, and to end the approach that is about attacking the foundations of our democracy, because you don't like the outcome and be clear on that point. Donald Trump, the candidate, has said in this election, there will be a blood bath. If this and the outcome of this election is not to his liking, let's turn the page",
            "start": "00:12:00",
            "end": "00:14:00"
        },
        {
            "text": "on this. Let's not go back. Let's chart a course for the future and not go backwards to the past. Let me just follow up here. It was a different term, and it was a term that related to energy, because they have destroyed our energy business. That was where blood bath was. Also, one Charlottesville, that story has been, as you would say, debunked, Laura Ingram. Sean Hannity, Jesse, all of these people, they covered it. If they go an extra sentence, they will see it was perfect. It was debunked in almost every newspaper, but they still bring it up, just like they bring 2025 up. They bring all of this stuff up. I ask you this. You talk about the Capitol. Why are we allowing these millions of people to come through on the Southern border? How come she's not doing anything? And I'll tell you what I would do, and I would be very proud to do it. I would say we would both leave this debate right now. I'd like to see her go down to Washington, D.C. during this debate, because we're wasting a lot of time. Go down to, because she's been so bad. It's so ridiculous. Go down to Washington, D.C. and let her sign a bill to close up the border, because they have the right to do it. They don't need bills. They have the right to do it. The president of the United States, you'll get him out of bed. You'll wake him up at four o'clock in the",
            "start": "00:14:00",
            "end": "00:16:00"
        },
        {
            "text": "afternoon. You'll say, come on. Come on down to the office. Let's sign a bill. If he signs a bill that the border is closed, only has to do a say it to the border patrol who are phenomenal. If they do that, the border is closed. Those people are killing many people, unlike J6. I want to turn to Afghanistan. It came up in the first hour of the debate, and we witnessed a poignant moment today on Capitol Hill honoring the soldiers who died in the chaotic withdrawal from Afghanistan. Do you want to ask the vice president? Do you believe you bear any responsibility in the way that withdrawal played out? Well, I will tell you, I agreed with President Biden's decision to pull out of Afghanistan. Four presidents said they would, and Joe Biden did. And as a result, America's taxpayers are not paying the $300 million a day. We were paying for that endless war. And as of today, there is not one member of the United States military who is an active duty in a combat zone, in any war zone around the world, the first time this century. But let's understand how we got to where we are. Donald Trump, when he was president, negotiated one of the weakest deals you can imagine. He calls himself a deal maker, even his national security adviser said it was a weak, terrible deal. And here's how it went down. He bypassed the Afghan government. He negotiated directly with a terrorist organization called the Taliban. The",
            "start": "00:16:00",
            "end": "00:18:00"
        },
        {
            "text": "negotiation involved the Taliban getting 5,000 terrorists, Taliban terrorists released. And get this, no get this. And the president at the time invited the Taliban to cap David a place of storied significance for us as Americans, a place where we honor the importance of American diplomacy where we invite and receive. Respected world leaders. And this former president, as president, invited them to cap David because he does not again appreciate the role and responsibility of the president of the United States to be commander in chief with a level of respect. And this gets back to the point of how he has consistently disperged and demeaned members of our military, fallen soldiers, and the work that we must do to uphold the strength and the respect of the United States of America around the world. Vice President Harris, thank you. President Trump, your response to her saying that you began the negotiations with the Taliban. Thank you. So if you take a look at that period of time, the Taliban was killing our soldiers, a lot of them with snipers. And I got involved with the Taliban because the Taliban was doing the killing. That's the fighting force within Afghanistan. They don't bother doing that because you know, they deal with the wrong people all the time. But I got involved and Abdul is the head of the Taliban. He is still the head of the Taliban. And I told Abdul don't do it anymore. You do it anymore. You're going to have problems. And he said, why",
            "start": "00:18:00",
            "end": "00:20:00"
        },
        {
            "text": "do you send me a picture of my house? I said, you're going to have to figure that out, Abdul. And for 18 months, we had nobody killed. We did have an agreement negotiated by Mike Pompeo. It was a very good agreement. The reason it was good. It was, we were getting out. We would have been out faster than them. But we wouldn't have lost the soldiers. We wouldn't have left many Americans behind. And we wouldn't have left. We wouldn't have left 85 billion dollars worth of brand new beautiful military equipment behind. And just to finish, they blew it. The agreement said you have to do this, this, this, this, this. And they didn't do it. They didn't do it. The agreement was, was terminated by us because they didn't do what they were supposed to do. I want to move on. And these people did the worst withdrawal. And in my opinion, the most embarrassing moment in the history of our country. And by the way, that's why Russia attacked Ukraine because they saw how incompetent she and her boss are. And this was a staggeringly dishonest debate performance from former President Trump. Just lie after lie on subject, after subject. By my preliminary count, Jake Trump made at least 33 false claims, 33. By contrast, by again, a preliminary count, Vice President Harris made at least one false claim, though she added at least a few misleading claims and a few more that lack key context. And I can say, well, all politicians lie,",
            "start": "00:20:00",
            "end": "00:22:00"
        },
        {
            "text": "no major presidential candidate before Donald Trump has ever lied with this kind of frequency. A remarkably large chunk of what he said tonight was just not true. And this wasn't like little exaggeration political spin. A lot of his false claims were untethered to reality. On abortion, saying every Democrat wanted Roe v. Wade overturned, though actually more than 80% of Democrats supported Roe on crime saying it's through the roof, though it's actually sharply down since early 2023. It's now lower than it was since Trump left office on health care saying he's the one who saved Obamacare, the law he actually repeatedly tried to overturn on Kamala Harris herself saying that a Howard University grad black law students association president had claimed that she wasn't black. At one point, frankly, I don't have enough time here to run through each specific Trump false claim. I urge people to go to our CNN website or our app to read our team's detailed facts checks on this and a whole bunch more. For now, though, let's dive into one false claim Trump made an agreedist claim about migrants supposedly eating people's pets. In Springfield, they're eating the dogs, the people that came in, they're eating the cats, they're eating the pets of the people that live there. This is not only false, I think it's fair to call this odious. This for people who have not been online in the last couple of days, this claim about migrants, Haitian migrants in Springfield, Ohio eating people's pets originated with a",
            "start": "00:22:00",
            "end": "00:24:00"
        },
        {
            "text": "Facebook post that attributed the claim to a neighbor's friend's daughter. So, a third hand broken telephone kind of thing, the city of Springfield and the Springfield police said there are no credible reports of this happening. And even JD Vance, the vice presidential candidate who himself had promoted these claims, acknowledged this morning that the quote rumors might turn out false, although he still encouraged people to spread these cat memes. Now I'll note that Trump himself added dogs to the equation. They had not even been part of these viral nonsense rumors before. Now let's look at a one false claim that Vice President Harris did make about the economic situation that the Biden-Harris Administration was left by Trump. Let's talk about what Donald Trump left us. Donald Trump left us the worst unemployment since the Great Depression. And what we have done is clean up Donald Trump's mess. So the Biden-Harris Administration was not actually left the worst unemployment since the Great Depression. They were left at 6.4% unemployment rate in January 2021. That was certainly elevated by recent standards pretty high, but it was significantly downed from the 14.8% level. It reached early in the pandemic, so it was already improving at the time the Biden-Harris Administration took office. And that 6.4% level was the highest since the Great Recession, so in the last 20 years, not going back decades further. The first results of our instant poll of debate watchers have just come in. David Chalian is going to join us now to break it",
            "start": "00:24:00",
            "end": "00:26:00"
        },
        {
            "text": "all down. David, tell us more. Yeah, Jake, and as you noted, this is a poll of debate watchers. This is not a poll that represents the overall population, although in partisan breakdown, it is pretty close to what the overall registered voter population looks like in the country. But it is a poll of those people that watched the debate. So just keep that in mind as we get to these results. Our first result here in our exclusive flash poll, who won the debate? The overall number here overwhelmingly Kamala Harris did. I'm going to look at my email here. 63% you see there on your screen. Say Kamala Harris won the debate. Only 37% say Donald Trump won the debate. And that is quite different than the expectations going into this among this group of debate watchers in this poll. We asked folks going into the debate, who do you expect to win the debate? Well, it was 50, 50% expected Harris, 50% expected Trump to win the debate. That was before the debate. And we just showed you where it ended up afterwards. 63% to 37%. And take a look at this, Jake. This is a complete reversal from what we saw in June. Compare these numbers to Biden in June. You see that it was 67% to 33%. Two thirds, taking Trump won only a third thinking Biden won a complete reversal in just a few months as this race has completely changed. So too has the assessment of debate watchers about the Democrat and",
            "start": "00:26:00",
            "end": "00:28:00"
        },
        {
            "text": "Republican debate performances this 2024 presidential election, Jake. All right, David Chellion. And while no doubt this debate will not be quite as consequential as the last one, it does seem as though a database that the, at least according to the instant polls of debate watchers, people think the Kamala Harris resoundingly won. And to fight expectations based on what people thought beforehand and afterwards. As David was saying, we have to be careful with instant polls. And what is really going to matter is how this sinks in and ripples through the pool, very small but important pool of undecided voters. But I think the only thing that you need to know about how Donald Trump realizes that this went was to see his behavior and performance, the fact that he came into this bedroom and he was not very happy. Insighting a bunch of numbers of polls that he said he won, no clue where those numbers came from. And he was asked about it in the spin room and didn't give an answer. But I also think, you know, Harris, there were some risks here for her tonight. And she had a lot of work to do. And I'm thinking about earlier when we were talking. And I was struck recently in the last couple of weeks, just watching Trump in his normal campaign world on the stump in interviews. And he is progressively slowing down. He is progressively not able to really even make his own normal kind of cases that he would make about",
            "start": "00:28:00",
            "end": "00:30:00"
        },
        {
            "text": "all sorts of issues. And that was on display tonight. I mean, she was really helped by Trump, just not really being able to kind of take it to her on virtually anything. And in a way, her biggest weakness might have been that when you give her something that she's not prepared for, she may or may not be able to address it. But Trump never did that. He only gave her things that it would be very obvious that he would say on the debate stage. And I think that's one of the main reasons that she was able to just kind of quite impressively actually take a lot of preparation and just spit it right out on that debate stage almost exactly probably the way her advisors wanted her to. And Trump just wasn't nimble enough to even respond to that. And he dove into his little pit of grievance and he's aging and it shows it's showing on the debates, it's showing on the campaign. One of the things that presidential debates have done over the years is that at times when people have had doubts about a candidate, usually the challenger in this race, you could argue they're both incumbents or both challengers. And it has erased the stature gap in 1960. Nixon was the vice president, the criticism of John Kennedy was that he was too young to calo to an experienced after that first debate that went away because people thought at the very least that Kennedy showed that he stood up and",
            "start": "00:30:00",
            "end": "00:32:00"
        },
        {
            "text": "was the Nixon's equal and perhaps his superior 1980 Jimmy Carter, a lot of concern. It was Ronald Reagan too big a risk and after that debate people were reassured they didn't they didn't like Carter particularly and they were reassured we can take this jump into Reagan in the New York Times poll over the weekend three times as many people said they needed to know more about Kamala Harris than said that about Donald Trump. And I got to think for a lot of that 28% of Americans that they were reassured by what they saw tonight so I think that it it gives permission to support her for people that had doubts. Well, there's two things I noticed one was the word that Senator JD Vance used the word platitudes when he talked to Caitlin Collins about how he describes the ability of vice president Harris to articulate her platforms. It's what is demanded of the incumbent versus what was actually provided by a former incumbent she's expected to talk in very granular detail Trump had very many balled assertions and yet he believes that he was successful in that endeavor nonetheless. The other issue is this important idea of managing expectations. She has described herself from the very get-go since she's actually taking the top and taking it as the underdog. In part because Democrats do not want a performance like this to have people believing there's no reason to lean in they can lean out everything's in the bag they know there is still the",
            "start": "00:32:00",
            "end": "00:34:00"
        },
        {
            "text": "uphill battle of trying to overcome a number of factors. So I think in many ways these are certain polar polls show you that even though this was a successful endeavor I think arguably and objectively for the vice president she still has to overcome this. I can't tell what the language encoding it is to have her define herself still.",
            "start": "00:34:00",
            "end": "00:36:00"
        }
    ],
    "timestamps": [
        {
            "time": "00:00:00 - 00:02:00",
            "summary": "vice president, fracking, has not been banned as vice president of the united states."
        },
        {
            "time": "00:02:00 - 00:04:00",
            "summary": "a hardworking mother who saved and saved her first home when she was a teenager."
        },
        {
            "time": "00:04:00 - 00:06:00",
            "summary": "fracking is a radical left liberal that would do this."
        },
        {
            "time": "00:06:00 - 00:08:00",
            "summary": "if she won the election, the day after that, they'll go back to destroying our country."
        },
        {
            "time": "00:08:00 - 00:10:00",
            "summary": "tv off the Oval Office sent out a video message telling supporters to go home."
        },
        {
            "time": "00:10:00 - 00:12:00",
            "summary": "aaron miller: you were the president, you were watching an unfold on television."
        },
        {
            "time": "00:12:00 - 00:14:00",
            "summary": "julian zelizer: the president of the united states incited a mob to attack our nation's capitol."
        },
        {
            "time": "00:14:00 - 00:16:00",
            "summary": "a new term was debunked in almost every newspaper, but they still bring it up."
        },
        {
            "time": "00:16:00 - 00:18:00",
            "summary": "a bill that would close the border is closed only has to say it to the border patrol."
        },
        {
            "time": "00:18:00 - 00:20:00",
            "summary": "former president invited the Taliban to cap David."
        },
        {
            "time": "00:20:00 - 00:22:00",
            "summary": "aaron miller: the agreement was good, but it was good, and we wouldn't have left many americans behind."
        },
        {
            "time": "00:22:00 - 00:24:00",
            "summary": "a lot of his false claims were untethered to reality."
        },
        {
            "time": "00:24:00 - 00:26:00",
            "summary": "a third hand broken telephone claim attributed the claim to a neighbor's daughter."
        },
        {
            "time": "00:26:00 - 00:28:00",
            "summary": "a poll of debate watchers is a complete reversal from what we saw in June."
        },
        {
            "time": "00:28:00 - 00:30:00",
            "summary": "julian zelizer: the instant polls of debate watchers show that the Kamala Harris won."
        },
        {
            "time": "00:30:00 - 00:32:00",
            "summary": "julian zelizer: she was really helped by Trump, just not being able to address it."
        },
        {
            "time": "00:32:00 - 00:34:00",
            "summary": "julian zelizer: vp's ability to articulate platforms is a big issue."
        },
        {
            "time": "00:34:00 - 00:36:00",
            "summary": "polar polls show vice president she still has to overcome this."
        }
    ]
}